*==================================================
* 0. 清空环境，确保无数据在内存中
*==================================================
clear all
set more off

*==================================================
* 1. 切换工作目录
*==================================================
cd "D:\导师\残疾伙伴与父母关系\Newceps"

*==================================================
* 2. 指定原始数据编码为 GB18030
*==================================================
unicode encoding set gb18030

*==================================================
* 3. 执行转码
*==================================================
* 学生数据
unicode translate "CEPS基线调查学生数据.dta", transutf8

* 家长数据
unicode translate "CEPS基线调查家长数据.dta", transutf8

* 班级数据
unicode translate "CEPS基线调查班级数据.dta", transutf8

* 学校数据
unicode translate "CEPS基线调查学校数据.dta", transutf8

*==================================================

*==================================================
use "CEPS基线调查学生数据.dta", clear
describe